NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A111F1536GM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>KEYSCAN_S</name>
      <version>1</version>
      <description>KEYSCAN_S Registers</description>
      <baseAddress>0x400B0000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>KEYSCAN</name>
        <value>69</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>IPVERSION</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>Enable</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Stops clocking and resets peripheral core logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables clocking, and begins scanning if CFG.AUTOSTART is 0x1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLING</name>
              <description>Disablement busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRST</name>
          <description>Software Reset</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESETTING</name>
              <description>Software reset busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Config</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x2501387F</resetValue>
          <resetMask>0x7753FFFF</resetMask>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEPRESS</name>
              <description>Single Press</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPRESS</name>
                  <description>After KEYIF is set and then cleared, scanning will continue. This can give multiple interrupts for the same key press, but allow multiple key presses to be detected. To use this mode for multi-key detection, the ISR should update a section of memory of COLNUM bytes on each interrupt, until key release is detected.  After key release, the section of memory where key presses are recorded can be processed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPRESS</name>
                  <description>After KEYIF has been set and cleared, it will not set again until no key press is detected.  This allows faster response since the ISR can start processing data as soon as the KEYIF is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOSTART</name>
              <description>Automatically Start</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOSTARTDIS</name>
                  <description>Auto start is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOSTARTEN</name>
                  <description>Auto start is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMROWS</name>
              <description>Number of Rows</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSV1</name>
                  <description>1 Row is not supported; defaults to 3 instead</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSV2</name>
                  <description>2 Rows are not supported; defaults to 3 instead</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW3</name>
                  <description>3 Rows</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW4</name>
                  <description>4 Rows</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW5</name>
                  <description>5 Rows</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW6</name>
                  <description>6 Rows</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMCOLS</name>
              <description>Number of Columns</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command </description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>KEYSCANSTART</name>
              <description>Keyscan Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEYSCANSTOP</name>
              <description>Keyscan Stop</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY</name>
          <description>Delay</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F00</resetMask>
          <fields>
            <field>
              <name>SCANDLY</name>
              <description>Scan Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCANDLY2</name>
                  <description>2ms Scan Delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY4</name>
                  <description>4ms Scan Delay</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY6</name>
                  <description>6ms Scan Delay</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY8</name>
                  <description>8ms Scan Delay</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY10</name>
                  <description>10ms Scan Delay</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY12</name>
                  <description>12ms Scan Delay</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY14</name>
                  <description>14ms Scan Delay</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY16</name>
                  <description>16ms Scan Delay</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY18</name>
                  <description>18ms Scan Delay</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY20</name>
                  <description>20ms Scan Delay</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY22</name>
                  <description>22ms Scan Delay</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY24</name>
                  <description>24ms Scan Delay</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY26</name>
                  <description>26ms Scan Delay</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY28</name>
                  <description>28ms Scan Delay</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY30</name>
                  <description>30ms Scan Delay</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANDLY32</name>
                  <description>32ms Scan Delay</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBDLY</name>
              <description>Debounce Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBDLY2</name>
                  <description>2ms Debounce Delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY4</name>
                  <description>4ms Debounce Delay</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY6</name>
                  <description>6ms Debounce Delay</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY8</name>
                  <description>8ms Debounce Delay</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY10</name>
                  <description>10ms Debounce Delay</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY12</name>
                  <description>12ms Debounce Delay</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY14</name>
                  <description>14ms Debounce Delay</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY16</name>
                  <description>16ms Debounce Delay</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY18</name>
                  <description>18ms Debounce Delay</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY20</name>
                  <description>20ms Debounce Delay</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY22</name>
                  <description>22ms Debounce Delay</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY24</name>
                  <description>24ms Debounce Delay</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY26</name>
                  <description>26ms Debounce Delay</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY28</name>
                  <description>28ms Debounce Delay</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY30</name>
                  <description>30ms Debounce Delay</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBDLY32</name>
                  <description>32ms Debounce Delay</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STABDLY</name>
              <description>Row stable Delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STABDLY2</name>
                  <description>2ms Row Stable Delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY4</name>
                  <description>4ms Row Stable Delay</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY6</name>
                  <description>6ms Row Stable Delay</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY8</name>
                  <description>8ms Row Stable Delay</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY10</name>
                  <description>10ms Row Stable Delay</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY12</name>
                  <description>12ms Row Stable Delay</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY14</name>
                  <description>14ms Row Stable Delay</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY16</name>
                  <description>16ms Row Stable Delay</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY18</name>
                  <description>18ms Row Stable Delay</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY20</name>
                  <description>20ms Row Stable Delay</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY22</name>
                  <description>22ms Row Stable Delay</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY24</name>
                  <description>24ms Row Stable Delay</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY26</name>
                  <description>26ms Row Stable Delay</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY28</name>
                  <description>28ms Row Stable Delay</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY30</name>
                  <description>30ms Row Stable Delay</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STABDLY32</name>
                  <description>32ms Row Stable Delay</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xC701003F</resetMask>
          <fields>
            <field>
              <name>ROW</name>
              <description>Row detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>Running</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COL</name>
              <description>Column Latched</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOKEY</name>
              <description>No Key pressed status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCBUSY</name>
              <description>Sync Busy</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>NOKEY</name>
              <description>No key was pressed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>A key was pressed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANNED</name>
              <description>Completed scan</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake up</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
